app/controllers/customers_controller.rb

INSERT INTO "customers" ("city", "created_at", "email", "name", "pincode", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city", nil], ["created_at", Wed, 22 Jun 2016 10:30:52 UTC +00:00], ["email", nil], ["name", nil], ["pincode", nil], ["updated_at", Wed, 22 Jun 2016 10:30:52 UTC +00:00]]
SELECT "customers".* FROM "customers"
---
	def create
		@customer = Customer.create(:name => params[:name], :email => params[:email], :city => params[:city], :pincode => params[:pincode])

		if @customer.save
	      redirect_to action: :index
	    else
	      render :new
	    end
		@customers = Customer.all

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "customers" SET "name" = 'VenkatSir', "updated_at" = '2016-06-22 10:48:31.655772' WHERE "customers"."id" = 6
---
	def update
		@customer = Customer.find(params[:id])
		if @customer.update_attributes(:name => params[:customer][:name], :email => params[:customer][:email], :city => params[:customer][:city], :pincode => params[:customer][:pincode])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 5]]
---
	def destroy
		@customer = Customer.find(params[:id])
  		@customer.destroy