app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 22 Jun 2016 11:44:26 UTC +00:00], ["name", "laptop"], ["price", 50000], ["updated_at", Wed, 22 Jun 2016 11:44:26 UTC +00:00]]
SELECT "items".* FROM "items"
---
	def create
		@item = Item.create(:name => params[:name], :price => params[:price])

		if @item.save
	      redirect_to action: :index
	    else
	      render :new
	    end
		@items = Item.all

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "items" SET "price" = 51000, "updated_at" = '2016-06-22 11:47:07.395277' WHERE "items"."id" = 4
---
	def update
		@item = Item.find(params[:id])
		if @item.update_attributes(:name => params[:item][:name], :price => params[:item][:price])